benchMark_Free_Convection/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-06;

boundaryField
{
    frontAndBack
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    topAndBottom
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    hot
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    cold
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
}


// ************************************************************************* //
